<?php

return [
    'singular' => 'مسؤول المنطقة',
    'plural' => 'مسؤولي المناطق',
    'empty' => 'لا يوجد مسؤولي مناطق حتى الان',
    'count' => 'عدد مسؤولي المناطق',
    'search' => 'بحث',
    'select' => 'اختر مسؤول المنطقة',
    'permission' => 'ادارة مسؤولي المناطق',
    'trashed' => 'مسؤولي المناطق المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن مسؤول منطقة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة مسؤول منطقة',
        'show' => 'عرض مسؤول المنطقة',
        'edit' => 'تعديل مسؤول المنطقة',
        'delete' => 'حذف مسؤول المنطقة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة مسؤول المنطقة بنجاح.',
        'updated' => 'تم تعديل مسؤول المنطقة بنجاح.',
        'deleted' => 'تم حذف مسؤول المنطقة بنجاح.',
        'restored' => 'تم استعادة مسؤول المنطقة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم مسؤول المنطقة',
        'aid_id' => 'المعرف الرئيسي لمسؤول المنطقة',
        'phone' => ' رقم الهاتف ',
        'address' => ' العنوان ',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف مسؤول المنطقة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة مسؤول المنطقة ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف مسؤول المنطقة نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];