<?php

return [
    'singular' => 'الخيار',
    'plural' => 'الخيارات',
    'empty' => 'لا يوجد خيارات حتى الان',
    'count' => 'عدد الخيارات',
    'search' => 'بحث',
    'select' => 'اختر الخيار',
    'permission' => 'ادارة الخيارات',
    'trashed' => 'الخيارات المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن خيار',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة خيار',
        'show' => 'عرض الخيار',
        'edit' => 'تعديل الخيار',
        'delete' => 'حذف الخيار',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الخيار بنجاح.',
        'updated' => 'تم تعديل الخيار بنجاح.',
        'deleted' => 'تم حذف الخيار بنجاح.',
        'restored' => 'تم استعادة الخيار بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الخيار',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الخيار ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الخيار ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الخيار نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
