<?php

return [
    'singular' => 'الشكوى',
    'plural' => 'الشكاوي',
    'empty' => 'لا يوجد شكاوي حتى الان',
    'count' => 'عدد الشكاوي',
    'search' => 'بحث',
    'select' => 'اختر الشكوى',
    'permission' => 'إدارة الشكاوي',
    'trashed' => 'الشكاوي المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن فرد',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة فرد',
        'show' => 'عرض الشكوى',
        'edit' => 'تعديل الشكوى',
        'delete' => 'حذف الشكوى',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'empty_filters'=>'تفريغ الحقول',
    ],
    'messages' => [
        'created' => 'تم اضافة الشكوى بنجاح.',
        'updated' => 'تم تعديل الشكوى بنجاح.',
        'deleted' => 'تم حذف الشكوى بنجاح.',
        'restored' => 'تم استعادة الشكوى بنجاح.',
    ],
    'attributes' => [
        'id_num' => 'رقم هوية مقدم الشكوى',
        'complaint_title' => 'عنوان الشكوى',
        'complaint_text' => 'نص الشكوى',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الشكوى ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الشكوى ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الشكوى نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];