<?php

return [
    'singular' => 'نوع الكوبون',
    'plural' => 'أنواع الكوبونات',
    'empty' => 'لا يوجد أنواع كوبونات حتى الان',
    'count' => 'عدد أنواع الكوبونات',
    'search' => 'بحث',
    'select' => 'اختر نوع الكوبون',
    'permission' => 'ادارة أنواع الكوبونات',
    'trashed' => 'أنواع الكوبونات المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن نوع كوبون',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة نوع كوبون',
        'show' => 'عرض نوع الكوبون',
        'edit' => 'تعديل نوع الكوبون',
        'delete' => 'حذف نوع الكوبون',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة نوع الكوبون بنجاح.',
        'updated' => 'تم تعديل نوع الكوبون بنجاح.',
        'deleted' => 'تم حذف نوع الكوبون بنجاح.',
        'restored' => 'تم استعادة نوع الكوبون بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم النوع',
        'description' => 'الوصف',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف نوع الكوبون ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة نوع الكوبون ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف نوع الكوبون نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
