<?php

return [
    'singular' => 'العائلة',
    'plural' => 'العائلات',
    'empty' => 'لا يوجد عائلات حتى الان',
    'count' => 'عدد العائلات',
    'search' => 'بحث',
    'select' => 'اختر العائلة',
    'permission' => 'ادارة العائلات',
    'trashed' => 'العائلات المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن عائلة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة عائلة',
        'show' => 'عرض العائلة',
        'edit' => 'تعديل العائلة',
        'delete' => 'حذف العائلة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة العائلة بنجاح.',
        'updated' => 'تم تعديل العائلة بنجاح.',
        'deleted' => 'تم حذف العائلة بنجاح.',
        'restored' => 'تم استعادة العائلة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم العائلة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف العائلة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة العائلة ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف العائلة نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
