<?php

return [
    'singular' => 'الطرد الداخلي',
    'plural' => 'الطرود الداخلية',
    'empty' => 'لا يوجد طرود داخلية حتى الان',
    'count' => 'عدد الطرود الداخلية',
    'search' => 'بحث',
    'select' => 'اختر الطرد الداخلي',
    'permission' => 'ادارة الطرود الداخلية',
    'trashed' => 'الطرود الداخلية المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن طرد داخلي',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة طرد داخلي',
        'show' => 'عرض الطرد الداخلي',
        'edit' => 'تعديل الطرد الداخلي',
        'delete' => 'حذف الطرد الداخلي',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الطرد الداخلي بنجاح.',
        'updated' => 'تم تعديل الطرد الداخلي بنجاح.',
        'deleted' => 'تم حذف الطرد الداخلي بنجاح.',
        'restored' => 'تم استعادة الطرد الداخلي بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الطرد',
        'description' => 'الوصف',
        'weight' => 'الوزن (كجم)',
        'quantity' => 'الكمية',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الطرد الداخلي ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الطرد الداخلي ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الطرد الداخلي نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
