<?php

return [
    'singular' => 'الموقع',
    'plural' => 'المواقع',
    'empty' => 'لا يوجد مواقع حتى الان',
    'count' => 'عدد المواقع',
    'search' => 'بحث',
    'select' => 'اختر الموقع',
    'permission' => 'ادارة المواقع',
    'trashed' => 'المواقع المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن موقع',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة موقع',
        'show' => 'عرض الموقع',
        'edit' => 'تعديل الموقع',
        'delete' => 'حذف الموقع',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الموقع بنجاح.',
        'updated' => 'تم تعديل الموقع بنجاح.',
        'deleted' => 'تم حذف الموقع بنجاح.',
        'restored' => 'تم استعادة الموقع بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الموقع',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الموقع ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الموقع ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الموقع نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
