<?php

return [
    'singular' => 'الخريطة',
    'plural' => 'الخرائط',
    'empty' => 'لا يوجد خرائط حتى الان',
    'count' => 'عدد الخرائط',
    'search' => 'بحث',
    'select' => 'اختر الخريطة',
    'permission' => 'ادارة الخرائط',
    'trashed' => 'الخرائط المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن خريطة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة خريطة',
        'show' => 'عرض الخريطة',
        'edit' => 'تعديل الخريطة',
        'delete' => 'حذف الخريطة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الخريطة بنجاح.',
        'updated' => 'تم تعديل الخريطة بنجاح.',
        'deleted' => 'تم حذف الخريطة بنجاح.',
        'restored' => 'تم استعادة الخريطة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الخريطة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الخريطة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الخريطة ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الخريطة نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
