<?php

return [
    'singular' => 'الحي',
    'plural' => 'الأحياء',
    'empty' => 'لا يوجد احياء حتى الان',
    'count' => 'عدد الأحياء',
    'search' => 'بحث',
    'select' => 'اختر الحي',
    'permission' => 'ادارة الأحياء',
    'trashed' => 'الأحياء المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن حي',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة حي',
        'show' => 'عرض الحي',
        'edit' => 'تعديل الحي',
        'delete' => 'حذف الحي',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الحي بنجاح.',
        'updated' => 'تم تعديل الحي بنجاح.',
        'deleted' => 'تم حذف الحي بنجاح.',
        'restored' => 'تم استعادة الحي بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الحي',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الحي ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الحي ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الحي نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
