<?php

return [
    'singular' => 'بند الصادر',
    'plural' => 'بنود الصادر',
    'empty' => 'لا يوجد بنود صادر حتى الان',
    'count' => 'عدد بنود الصادر',
    'search' => 'بحث',
    'select' => 'اختر بند الصادر',
    'permission' => 'ادارة بنود الصادر',
    'trashed' => 'بنود الصادر المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن بند صادر',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة بند صادر',
        'show' => 'عرض بند الصادر',
        'edit' => 'تعديل بند الصادر',
        'delete' => 'حذف بند الصادر',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة بند الصادر بنجاح.',
        'updated' => 'تم تعديل بند الصادر بنجاح.',
        'deleted' => 'تم حذف بند الصادر بنجاح.',
        'restored' => 'تم استعادة بند الصادر بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم بند الصادر',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف بند الصادر ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة بند الصادر ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف بند الصادر نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
