<?php

return [
    'singular' => 'محتوى الطرد',
    'plural' => 'محتويات الطرود',
    'empty' => 'لا يوجد محتويات طرود حتى الان',
    'count' => 'عدد محتويات الطرود',
    'search' => 'بحث',
    'select' => 'اختر محتوى الطرد',
    'permission' => 'ادارة محتويات الطرود',
    'trashed' => 'محتويات الطرود المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن محتوى طرد',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة محتوى طرد',
        'show' => 'عرض محتوى الطرد',
        'edit' => 'تعديل محتوى الطرد',
        'delete' => 'حذف محتوى الطرد',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة محتوى الطرد بنجاح.',
        'updated' => 'تم تعديل محتوى الطرد بنجاح.',
        'deleted' => 'تم حذف محتوى الطرد بنجاح.',
        'restored' => 'تم استعادة محتوى الطرد بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم محتوى الطرد',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف محتوى الطرد ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة محتوى الطرد ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف محتوى الطرد نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
