<?php

return [
    'singular' => 'المنطقة',
    'plural' => 'المناطق',
    'empty' => 'لا يوجد مناطق حتى الان',
    'count' => 'عدد المناطق',
    'search' => 'بحث',
    'select' => 'اختر المنطقة',
    'permission' => 'ادارة المناطق',
    'trashed' => 'المناطق المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن منطقة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة منطقة',
        'show' => 'عرض المنطقة',
        'edit' => 'تعديل المنطقة',
        'delete' => 'حذف المنطقة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المنطقة بنجاح.',
        'updated' => 'تم تعديل المنطقة بنجاح.',
        'deleted' => 'تم حذف المنطقة بنجاح.',
        'restored' => 'تم استعادة المنطقة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم المنطقة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المنطقة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المنطقة ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المنطقة نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
