<?php

return [
    'singular' => 'المخزن الفرعي',
    'plural' => 'المخازن الفرعية',
    'empty' => 'لا يوجد مخازن فرعية حتى الان',
    'count' => 'عدد المخازن الفرعية',
    'search' => 'بحث',
    'select' => 'اختر المخزن الفرعي',
    'permission' => 'ادارة المخازن الفرعية',
    'trashed' => 'المخازن الفرعية المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن مخزن فرعي',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة مخزن فرعي',
        'show' => 'عرض المخزن الفرعي',
        'edit' => 'تعديل المخزن الفرعي',
        'delete' => 'حذف المخزن الفرعي',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المخزن الفرعي بنجاح.',
        'updated' => 'تم تعديل المخزن الفرعي بنجاح.',
        'deleted' => 'تم حذف المخزن الفرعي بنجاح.',
        'restored' => 'تم استعادة المخزن الفرعي بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم المخزن الفرعي',
        'address' => 'العنوان',
        'phone' => 'رقم الهاتف',
        'contact_person' => 'اسم المسؤول',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المخزن الفرعي ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المخزن الفرعي ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المخزن الفرعي نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
