<?php

return [
    'singular' => 'المدينة الفرعية',
    'plural' => 'المدن الفرعية',
    'empty' => 'لا يوجد مدن فرعية حتى الان',
    'count' => 'عدد المدن الفرعية',
    'search' => 'بحث',
    'select' => 'اختر المدينة الفرعية',
    'permission' => 'ادارة المدن الفرعية',
    'trashed' => 'المدن الفرعية المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن مدينة فرعية',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة مدينة فرعية',
        'show' => 'عرض المدينة الفرعية',
        'edit' => 'تعديل المدينة الفرعية',
        'delete' => 'حذف المدينة الفرعية',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المدينة الفرعية بنجاح.',
        'updated' => 'تم تعديل المدينة الفرعية بنجاح.',
        'deleted' => 'تم حذف المدينة الفرعية بنجاح.',
        'restored' => 'تم استعادة المدينة الفرعية بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم المدينة الفرعية',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المدينة الفرعية ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المدينة الفرعية ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المدينة الفرعية نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
