<?php

return [
    'singular' => 'المورد',
    'plural' => 'الموردين',
    'empty' => 'لا يوجد موردين حتى الان',
    'count' => 'عدد الموردين',
    'search' => 'بحث',
    'select' => 'اختر المورد',
    'permission' => 'ادارة الموردين',
    'trashed' => 'الموردين المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن مورد',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة مورد',
        'show' => 'عرض المورد',
        'edit' => 'تعديل المورد',
        'delete' => 'حذف المورد',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المورد بنجاح.',
        'updated' => 'تم تعديل المورد بنجاح.',
        'deleted' => 'تم حذف المورد بنجاح.',
        'restored' => 'تم استعادة المورد بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم المورد',
        'description' => 'وصف المورد',
        'image' => 'صورة المورد',
        'document' => 'ملف المورد',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المورد ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المورد ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المورد نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
