<?php

return [
    'singular' => 'الجهة المتعاونة',
    'plural' => 'الجهات المتعاونة',
    'empty' => 'لا يوجد جهات متعاونة حتى الان',
    'count' => 'عدد الجهات المتعاونة',
    'search' => 'بحث',
    'select' => 'اختر الجهة المتعاونة',
    'permission' => 'ادارة الجهات المتعاونة',
    'trashed' => 'الجهات المتعاونة المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن جهة متعاونة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة جهة متعاونة',
        'show' => 'عرض الجهات المتعاونة',
        'edit' => 'تعديل الجهة المتعاونة',
        'delete' => 'حذف الجهة المتعاونة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الجهة المتعاونة بنجاح.',
        'updated' => 'تم تعديل الجهة المتعاونة بنجاح.',
        'deleted' => 'تم حذف الجهة المتعاونة بنجاح.',
        'restored' => 'تم استعادة الجهة المتعاونة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الجهة المتعاونة',
        'description' => 'وصف الجهة المتعاونة',
        'image' => 'صورة الجهة المتعاونة',
        'document' => 'ملف الجهة المتعاونة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الجهة المتعاونة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الجهة المتعاونة ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الجهة المتعاونة نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];