<?php

return [
    'arabicWords' => [
        'country' => ['الدولة', 'الدول', 'دولة', 'دول'],
        'city' => ['المدينة', 'المدن', 'مدينة', 'مدن'],
        'sub_city' => ['المدينة الفرعية', 'المدن الفرعية', 'مدينة فرعية', 'مدن فرعية'],
        'neighborhood' => ['الحي', 'الأحياء', 'حي', 'احياء'],
        'category' => ['القسم', 'الاقسام', 'قسم', 'اقسام'],
        'page' => ['الصفحة', 'الصفحات الثابته', 'صفحة', 'صفحات'],
        'feedback' => ['الرسالة', 'رسائل اتصل بنا', 'رسالة', 'رسائل'],
        'family' => ['العائلة', 'العائلات', 'عائلة', 'عائلات'],
        'person' => ['الفرد', 'الأفراد', 'فرد', 'افراد'],
        'complaint' => ['الشكوى', 'الشكاوى', 'شكوى', 'شكاوى'],
    ],
];
